tests/load/socket-test.yml
config:
  target: "http://127.0.0.1:5001"
  processor: "./socket-processor.cjs"
  phases:
    - duration: 30
      arrivalCount: 5
      maxVusers: 5
      name: "safe start: 5 socket users"
    - duration: 30
      arrivalCount: 20
      maxVusers: 20
      name: "ramp: 20 socket users"
    - duration: 30
      arrivalCount: 50
      maxVusers: 50
      name: "ramp: 50 socket users"
scenarios:
  - name: "login and maintain Socket.IO connection"
    flow:
      - function: "runSocketUser"